---
title: ExportPatternKey
classe: Autodesk.Revit.DB.ExportPatternKey
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ExportPatternKey

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `exportPatternKey.IsValidObject` | Boolean |
| `String OriginalFillPatternName { get; set; }` | `exportPatternKey.OriginalFillPatternName` | String |
| `FillPatternTarget OriginalFillPatternType { get; set; }` | `exportPatternKey.OriginalFillPatternType` | FillPatternTarget |
| `Void Dispose()` | `exportPatternKey.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```